
def area(a, b): 
    """Вычисляет площадь прямоугольника.

    Площадь прямоугольника вычисляется как произведение
    его длины и ширины: S = a * b.

    Args:
        a (float): Длина прямоугольника.
        b (float): Ширина прямоугольника.

    Returns:
        float: Площадь прямоугольника.

    Example:
        >>> area(2, 3)
        6
        >>> area(5, 4)
        20
    """
    return a * b 

def perimeter(a, b): 
    """Вычисляет периметр прямоугольника.

    Периметр прямоугольника вычисляется как удвоенная
    сумма его длины и ширины: P = 2 * (a + b).

    Args:
        a (float): Длина прямоугольника.
        b (float): Ширина прямоугольника.

    Returns:
        float: Периметр прямоугольника.

    Example:
        >>> perimeter(2, 3)
        10
        >>> perimeter(5, 4)
        18
    """
    return 2 * (a + b) 